[
  {
    "practiceId": "371ec4a1-ee46-42cf-8d1a-ff85ae24bc1d",
    "summary": "Error generating AI summary: The security token included in the request is invalid.. Manual review of responses may be needed.",
    "generatedAt": "2026-01-03T22:33:41.537Z"
  },
  {
    "practiceId": "35f669fc-f8f4-4ea6-85a8-f34b2132c4a3",
    "summary": "Error generating AI summary: The security token included in the request is invalid.. Manual review of responses may be needed.",
    "generatedAt": "2026-01-03T22:55:56.103Z"
  },
  {
    "practiceId": "8a49b896-79ed-4608-ba97-eb2ba9dd66b2",
    "summary": "No responses were submitted for this practice session.",
    "generatedAt": "2026-01-03T23:08:45.583Z"
  },
  {
    "practiceId": "5ade3da9-93cd-4a8d-bb4d-426fad9e8080",
    "summary": "No responses were submitted for this practice session.",
    "generatedAt": "2026-01-03T23:18:57.673Z"
  },
  {
    "practiceId": "4ece535a-46d2-4a0a-8ead-b68b7220d5be",
    "summary": "### Summary of Volleyball Practice Feedback\n\n#### 1. Overall Performance Themes\n- **Self-assessment:** Players, including Player 1, generally provided honest self-assessments, indicating areas where they feel they need improvement.\n  \n#### 2. Common Challenges Mentioned\n- **Setting:** Setting was a recurring challenge mentioned by Player 1, suggesting it may be a common difficulty among players.\n\n#### 3. Skills That Players Focused On\n- **Setting:** The feedback indicates that setting is a skill that players are currently focusing on improving. This suggests it might be a key area in the current training regimen.\n\n#### 4. Areas for Improvement in Future Practices\n- **Setting Drills:** Given the emphasis on setting, future practices should incorporate more focused drills on improving setting techniques.\n- **Individual Feedback:** Players should receive more personalized feedback to address their specific weaknesses, especially in setting.\n\n#### 5. Notable Individual Insights\n- **Player 1:** This player expressed a lack of confidence in their performance, particularly in setting. The repetition of \"life\" suggests a broader concern beyond just volleyball, which could indicate a need for more holistic support or encouragement.\n\n### Actionable Insights for the Coach\n- **Enhance Setting Drills:** Incorporate more setting-specific drills in practice to address the common challenge.\n- **Personalized Feedback:** Provide tailored feedback to each player, focusing on their individual areas of difficulty.\n- **Confidence Building:** Consider addressing broader confidence issues, particularly for Player 1, through motivational support and positive reinforcement.\n\nThis summary highlights key areas for targeted improvements in future practices to enhance overall team performance and individual player development.",
    "generatedAt": "2026-01-03T23:19:38.714Z"
  }
]